{
    "docs": [],
    "path": "articles/blogs/paper_review_artistic_style.pdf",
    "text": "Paper Review\nAuthor: Yunfei Luo\nMay 12, 2020\n||||||||||||||||||||||||||||||||||||||||\nA Neural Algorithm of Artistic Style, by Gatys, Ecker, and Bethge\nReference Paper URL: https://arxiv.org/abs/1508.06576\nIntroduction/Main Goal\nThe paper was published in 2015. The main goal of the paper is to introduce an artificial system\nthat could create artistic images like what human could do with painting. The core of the system\nis a neural algorithm based on Deep Neural Networks. A sub-goal of the paper is to describe how\nhuman create and perceive artistic images, with algorithmic approach.\nWhat's New/Improvement\nThe authors are not trying improve, but rather, explore a new field of application of Deep Neural\nNetworks. They notice that, during the image processing by the neural networks, the actual features\n(the mapping of different filtered versions of image) and the correlation between different filters can\nbe individually visualized at each layer. They called them \"content representation\" and \"style rep-\nresentation\" respectively. So they are thinking about combining the representations of content and\nstyle to make something out.\nObservations\nAs a paper on the neural networks, the input and output in this case are both images, with the\nnormal image structures, i.e. the 2-D matrix of pixels. More specifically, the inputs are two images,\none for capturing the content representation, one for extracting style representation. The output is\nan image that combine the content and style representation through image reconstruction. More-\nover, there do exists a hidden state. Since during the match of content and style, if emphasizing\nmore on the content, it will be obvious to detect what was the original photograph with less variant\nin the style. Same as if emphasizing more on the style, then content of the image might be hard to\nsee, i.e. the image would be too abstractionism. So the hidden state would be some reconstructed\nimage with \"just-right\" weights for content and style.\nResult\nIn order to dealing with this tasks, the authors done it through a optimization problem on minimiz-\ning the linear combination of the loss functions of content and style. The weights, or the coe\u000ecients\nof the loss functions could be understand as the \"regularizers\" that serves for the extent of how much\nthe image emphasize on content and style. For the result that the authors got (page 5 in the paper):\n\nIt seems like the Deep Neural Networks perform pretty well on applying different artistic styles, from\nlearning of other artworks, on the photo shown in A. To intuitively interpret these results, the neu-\nral algorithm do effectively facsimile the photograph with artistic styles of some well-known artists,\nsuch as J.M.W. Turner and Vincent Van Gogh.\n\nExtension/Follow up\nWhat would happen if combining content with content, and style with style? An intuitive instance\nwould be, suppose that there is a photo of a cat, and another photo of a dog, what if we use the\ncontent representations of these two images from the Deep Neural Network for image reconstruc-\ntion? How to construct the optimization problem in this case, in order to made an image that have\nthe key content in both original images with relatively \"just right\" weights and positions? These\nfollow-up questions others the possible extension for the work presented in the paper.\n",
    "id": -1,
    "summery": "The main goal of the paper is to introduce an artificial system that could create artistic images like what human could do with painting.",
    "tags": [
      "Machine Learning",
      "Artificial Intelligence",
      "Neural Networks",
      "Numerical Optimization",
      "Image Processing"
    ],
    "type": "blog",
    "title": "Image Reconstruction with Artistic Style, Paper Review"
}